"""
Homework 14
Когда продолжаешь верить в чудеса...
"""

print(
    '\tПривет!\n\tМеня зовут Катя! Я студент в Академии "Топ".\n\tХочу выразить благодарность нашему преподавателю Владимиру за доступную подачу информации, а также за большой объем предоставленных дополнительных материалов.\n\tВерю, что в новогодние праздники, лежа под елкой и уворачиваясь от "случайно" падающих на меня елочных игрушек, под крики детей и иногда жалобные мяуканья пострадавшей от них кошки, смогу наконец отвлечься от работы и насладиться всеми возможностями, которые открывает перед нами наша Академия.\n\tДа-да, такая большая, а в сказки верю!\n\tВерю, что дети не будут развлекать меня бесконечными поездками к педиатру (c попытками убить меня елочными игрушками даже спорить не буду). Верю, что Центральный Банк не устроит нам рабочие выходные обещанием очередной ревизии. Верю, что это будет время, когда я смогу погрузиться в мир новых знаний и опыта, которые мне предоставляют в Академии.\n\tP.s.: да услышит меня дед Мороз, ни к ночи упомянутая Эльвира Сахипзадовна Набиуллина и самое главное любимый муж (на которого и лягут все заботы о детях и кошке в эти чудесные праздничные дни)!!!'
)
